{
	  "events": [
	    {
            "dtstart": "20101119 1000", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "Introduction to HP webOS, Part 1", 
            "description": "Getting started / Emulator and debugging",
            "attendee": "Ben Combee, Josh Marinacci",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1115", 
            "location": "Track 1",
	    "duration" : "01:30",
            "title": "Introduction to HP webOS, Part 2", 
            "description": "Device Services and APIs / Intro to the Plug-in Development Kit",
            "attendee": "Ben Combee, Josh Marinacci",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1115", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Copyright Law for Developers", 
            "description": "This session is an introduction to the business side of developing apps for the global market. It covers the issues surrounding intellectual property and copyright laws and the implications of the development and deployment tactics used. Learn the impact of decisions such as open source vs. closed, incorporating the work of others into your app, porting and cloning apps from other platforms, and controlling ownership of your end product.",
            "attendee": "Prof. Jonathan I. Ezor",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1345", 
            "location": "Track 1",
	    "duration" : "01:45",
            "title": "Introduction to HP webOS, Part 3", 
            "description": "Ares Demo / Mojo / Intro to Frameworks and PhoneGap demo",
            "attendee": "Ben Combee, Josh Marinacci",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1345", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Homebrew: Community and WebOS Internals", 
            "description": "In this session one of the most passionate and knowledgeable members of the homebrew community will provide an overview of the WebOS internals open source homebrew development organization. Rod Whitby takes us on a tour of the architecture, operation, and ecosystem to show how to develop third-party webOS patches, themes, and kernels. Learn how this innovative community develops after-market modifications and customizations in an ethical and collaborative way to achieve high-quality results. Q & A will follow the presentation.",
            "attendee": "Rod Whitby",
            "url": "",
            "pbfeventid" : 0},
            {
            "dtstart": "20101119 1500", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Drive Your App to Success with Metrics", 
            "description": "How do you know what to develop and where to market it? How do you know if that change you made had an impact? App analytics is key to understanding your user base. With understanding, you can focus your efforts more effectively and efficiently. This session will cover key app performance indicators and how to interpret them. We will look at various tools and methods for collecting metrics that matter.",
            "attendee": "Greg Hrebek",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1600", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "The Liar's Show", 
            "description": "Experience a live 60-minute storytelling event—with a twist. Four professional storytellers each tell a 10-minute tech-related story. All the stories are surprising but only three are true. One story is pure fiction. After all the storytellers are done, the audience interrogates them to find the truth. At the very end, the liar is revealed. Seek truth, win prizes.",
            "attendee": "Everyone",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101119 1700", 
            "location": "Track 1",
	    "duration" : "02:00",
            "title": "Onsite Networking Event", 
            "description": "Network with your peers and the HP webOS Developer Relations team over delicious food and Brooklyn Brewery’s seasonal beer on tap.",
            "attendee": "Everyone",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 0900", 
            "location": "Track 1",
	    "duration" : "01:10",
            "title": "Welcome and Keynote", 
            "description": "",
            "attendee": "Ben Galbraith, Dion Almaer, Phil McKinney, Joe Hayashi",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1020", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Cross-Platform Web Development with PhoneGap", 
            "description": "PhoneGap is an open source, cross-platform tool for writing a single code that runs on multiple mobile platforms using just HTML, JavaScript, and CSS. It is not a full OS toolkit and does not provide GUI widgets or high-level features. It’s simply a common API and set of build tools that give you uniform access to the browser and device services. JavaScript fans won’t want to miss this brisk walk-through of Nitobi’s popular PhoneGap project courtesy of lead architect Brian Leroux, creator of XUI and Lawnchair. Get tips on developing effective mobile web apps and learn how you can use your web programming skills to bridge mobile platform gaps.",
            "attendee": "Brian LeRoux, Nitobi",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1020", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "Hybrid Apps and Cross-Platform Development using the PDK", 
            "description": "There are different ways to develop and deploy cross-platform apps. Hybrid apps allow the developer to unlock the best of both browser interfaces and native mobile components. Using HTML5 and JavaScript, browsers can access a phone’s built-in features like contacts, camera, and calendar. The HP webOS PDK enables developers to use third-party engines and libraries to develop C/C++ apps for webOS and other mobile platforms. In this session, Ben Combee explains two options for cross-platform development and discusses the impacts and advantages of each. Engineers from Quickoffice and Airplay present case studies on how they leveraged their code and assets to bring rich immersive games and applications to webOS and other platforms.",
            "attendee": "Ben Combee, Jelte Liebrand, Sam Clegg",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1130", 
            "location": "Track 1",
	    "duration" : "00:30",
            "title": "Marketing your Apps: the Business of webOS Development", 
            "description": "You’ve developed a killer webOS app. Now what? Joe Hayashi reviews some guidelines, best practices, and recommendations for successfully taking your app to market. Joe also discusses some upcoming enhancements to the webOS App Catalog and how you can take advantage of them.",
            "attendee": "Joe Hayashi",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1130", 
            "location": "Track 2",
	    "duration" : "00:30",
            "title": "webOS under the Hood: Optimizing Performance", 
            "description": "Ever wonder what makes webOS tick? Find out in this session as we review the browser and JavaScript engines that power webOS. Learn how those engines are configured on the device and how to optimize performance on webOS. Get tips for developing directly on our web platform.",
            "attendee": "Greg Simon",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1300", 
            "location": "Track 2",
	    "duration" : "00:30",
            "title": "Lightening Rounds", 
            "description": "A handful of our talented developers each showcase an app and talk about the experience of developing for webOS in five-minute lightening-round presentations.",
            "attendee": "Jeremy Thomas, Geoff Gauchet, James Harris, Brian Haeffner, NiteOwl",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1340", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "Cross-Platform Web Apps Panel", 
            "description": "Building a mobile app usually involves using one proprietary SDK that targets one platform. This ensures a native look and feel as well as full access to features specific to that device or operating system. Sometimes, however, you don’t need full device access. Sometimes you might want to code at a very high level using just web standards and be able to run the application on multiple operating systems. This is similar to coding a mobile website, except that as a local application your app can launch faster, work offline, and have access to local resources. This session presents unique insights into solutions to cross-platform fragmentation.",
            "attendee": "Ben Galbraith, Dion Almaer, Brian LeRoux, Charles Jolly, Dave Balmer, Greg Avola",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1450", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "webOS 2.0 Features and Implementation for Facebook", 
            "description": "Get an inside look at webOS 2.0 using our Facebook apps as the case study on how they can be employed. Kevin and Gray take turns introducing some great new 2.0 platform features and discuss when and how innovations such as Just Type, Card Stacks and Exhibition can be easily implemented to improve the experience of any application.",
            "attendee": "Grey Norton, Kevin Decker",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1450", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Frameworks Landscape Survey", 
            "description": "Though webOS ships with its own excellent Mojo UI toolkit, developers have the option to use any JavaScript toolkit they wish to develop rich cross-platform web and mobile applications. Some do it with no tool kit at all. This session takes you on a tour of three of our favorite Javascript toolkits including PhoneGap, JQuery Mobile and Jo and provides a landscape perspective on how to decide which one is right for you.",
            "attendee": "Dave Balmer, Josh Marinacci",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1600", 
            "location": "Track 1",
	    "duration" : "01:00",
            "title": "Rockstar Apps with HTML5", 
            "description": "The next installment in the Rockstar series picks up where Rockstar graphics left off. Learn some of the most practical ways to create more engaging, robust apps by incorporating animation, sound, and trickery. The techniques demonstrated show how a little bit of JavaScript and some clever CSS3 can add some sizzle and make your apps more appealing to the end user.",
            "attendee": "Dave Balmer",
            "url": "",
            "pbfeventid" : 0},
	    {
            "dtstart": "20101120 1600", 
            "location": "Track 2",
	    "duration" : "01:00",
            "title": "Introduction to node.js and JavaScript Services on webOS", 
            "description": "Third-party services are an important new tool within webOS 2.0. This session covers basics of JavaScript services, including service interfaces, service lifecycle and a basic service example. Advanced topics include debugging, application packaging, and more node.js topics such as web services and file I/O. Learn how and when services should be used with their application, how services are packaged and distributed, and how node.js runs on webOS.",
            "attendee": "Kevin Hague",
            "url": "",
            "pbfeventid" : 0},
            {
            "dtstart": "20101120 1710", 
            "location": "Track 1",
	    "duration" : "00:35",
            "title": "A First Look at Enyo, Next Generation webOS App Framework", 
            "description": "This session offers a sneak peek of what's next for JavaScript development on webOS. Learn about the benefits of the next-generation framework and its impact on webOS developers. In addition to giving an overview of the framework and supporting tools, Matt will demonstrate applications built using this new technology.",
            "attendee": "Matthew McNulty",
            "url": "",
            "pbfeventid" : 0}
	   ]
}
